tutorials/multiphaseEuler/wallBoilingIATE/0/kappai.gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  14
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      kappai.gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions          [length^-1];

internalField       uniform 13333;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           $internalField;
    }

    outlet
    {
        type            inletOutlet;
        phi             phi.gas;
        inletValue      $internalField;
    }

    wall
    {
        type            zeroGradient;
    }

    front
    {
        type            wedge;
    }

    back
    {
        type            wedge;
    }
}

sources
{
    heatTransferLimitedPhaseChange
    {
        type            interfacialGrowthInterfacialCurvature;
    }

    wallBoiling
    {
        type            nucleationInterfacialCurvature;
        libs            ("libmultiphaseEulerFvModels.so");
    }
}

// ************************************************************************* //
